import React from "react";
import { useTheme } from "../../ThemeContext";
import IconGreen from "../../assets/svg/icon-green.svg";
import IconWhite from "../../assets/svg/icon-white.svg";
import "./dataIV.scss";

const DataIV = () => {
  const { theme } = useTheme();

  return (
    <div className="main-container-Data-IV">
      {/* Section-I */}
      <div className="section-I-Data-IV">
        {/* Header */}
        <div className="header-ist-section-i-data-II">
          <img
            src={
              theme === "green"
                ? IconGreen
                : theme === "light"
                ? IconWhite
                : IconGreen
            }
            alt="logo"
          />
          <p className="fs-md fw-700 lh-1-2">المخطط</p>
        </div>
        {/* Table Content */}
        <div className="table-container-Data-IV">
          <table className="responsive-table-Data-IV">
            <thead className="fs-md fw-700 lh-1-2 text-center">
              <tr>
                <th>عنوان المهمة</th>
                <th>الوصف</th>
                <th>نسبة الاكتمال</th>
                <th>تاريخ الانتهاء المتوقع</th>
              </tr>
            </thead>
            <tbody  className="fs-m fw-600 lh-1-2 text-center">
              <tr>
                <td>خطأ في عنوان الفاتورة</td>
                <td>حدث في عنوان الفاتورة اسم الشركة مختلف عن المتعاقد</td>
                <td>0%</td>
                <td>14/01/2025</td>
              </tr>
              <tr>
                <td>لم يتم تحديث المخاطر</td>
                <td>
                  يرجى تحديث سجل المخاطر أو إغلاق المخاطر في حال انتهائها أو
                  تعديل التاريخ المتوقع لإغلاقها
                </td>
                <td>0%</td>
                <td>06/02/2025</td>
              </tr>
              <tr>
                <td>لم يتم تحديث المخاطر</td>
                <td>
                  يرجى تحديث سجل المخاطر أو إغلاق المخاطر في حال انتهائها أو
                  تعديل التاريخ المتوقع لإغلاقها
                </td>
                <td>0%</td>
                <td>06/02/2025</td>
              </tr>
              <tr>
                <td>لم يتم تحديث المخاطر</td>
                <td>
                  يرجى تحديث سجل المخاطر أو إغلاق المخاطر في حال انتهائها أو
                  تعديل التاريخ المتوقع لإغلاقها
                </td>
                <td>0%</td>
                <td>06/02/2025</td>
              </tr>
              <tr>
                <td>لم يتم تحديث المخاطر</td>
                <td>
                  يرجى تحديث سجل المخاطر أو إغلاق المخاطر في حال انتهائها أو
                  تعديل التاريخ المتوقع لإغلاقها
                </td>
                <td>0%</td>
                <td>06/02/2025</td>
              </tr>
              <tr>
                <td>لم يتم تحديث المخاطر</td>
                <td>
                  يرجى تحديث سجل المخاطر أو إغلاق المخاطر في حال انتهائها أو
                  تعديل التاريخ المتوقع لإغلاقها
                </td>
                <td>0%</td>
                <td>06/02/2025</td>
              </tr>
              <tr>
                <td>لم يتم تحديث المخاطر</td>
                <td>
                  يرجى تحديث سجل المخاطر أو إغلاق المخاطر في حال انتهائها أو
                  تعديل التاريخ المتوقع لإغلاقها
                </td>
                <td>0%</td>
                <td>06/02/2025</td>
              </tr>

              <tr>
                <td>لم يتم تحديث المخاطر</td>
                <td>
                  يرجى تحديث سجل المخاطر أو إغلاق المخاطر في حال انتهائها أو
                  تعديل التاريخ المتوقع لإغلاقها
                </td>
                <td>0%</td>
                <td>06/02/2025</td>
              </tr>
              <tr>
                <td>لم يتم تحديث المخاطر</td>
                <td>
                  يرجى تحديث سجل المخاطر أو إغلاق المخاطر في حال انتهائها أو
                  تعديل التاريخ المتوقع لإغلاقها
                </td>
                <td>0%</td>
                <td>06/02/2025</td>
              </tr>
              <tr>
                <td>لم يتم تحديث المخاطر</td>
                <td>
                  يرجى تحديث سجل المخاطر أو إغلاق المخاطر في حال انتهائها أو
                  تعديل التاريخ المتوقع لإغلاقها
                </td>
                <td>0%</td>
                <td>06/02/2025</td>
              </tr>
              <tr>
                <td>لم يتم تحديث المخاطر</td>
                <td>
                  يرجى تحديث سجل المخاطر أو إغلاق المخاطر في حال انتهائها أو
                  تعديل التاريخ المتوقع لإغلاقها
                </td>
                <td>0%</td>
                <td>06/02/2025</td>
              </tr>
              <tr>
                <td>لم يتم تحديث المخاطر</td>
                <td>
                  يرجى تحديث سجل المخاطر أو إغلاق المخاطر في حال انتهائها أو
                  تعديل التاريخ المتوقع لإغلاقها
                </td>
                <td>0%</td>
                <td>06/02/2025</td>
              </tr>
              <tr>
                <td>لم يتم تحديث المخاطر</td>
                <td>
                  يرجى تحديث سجل المخاطر أو إغلاق المخاطر في حال انتهائها أو
                  تعديل التاريخ المتوقع لإغلاقها
                </td>
                <td>0%</td>
                <td>06/02/2025</td>
              </tr>
              <tr>
                <td>لم يتم تحديث المخاطر</td>
                <td>
                  يرجى تحديث سجل المخاطر أو إغلاق المخاطر في حال انتهائها أو
                  تعديل التاريخ المتوقع لإغلاقها
                </td>
                <td>0%</td>
                <td>06/02/2025</td>
              </tr>
            </tbody>
          </table>
        </div>
      </div>
    </div>
  );
};

export default DataIV;